micropython/micropython/ports/esp32/machine_pwm.c
// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel, 0);
            }
        }
        pwm_inited = false;
    }
}

static void pwm_is_active(machine_pwm_obj_t *self) {
    if (self->timer < 0) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
static int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    int64_t duty = ((int64_t)ns * MAX_16_DUTY * self->freq + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > MAX_16_DUTY) {
        duty = MAX_16_DUTY;
    }
    return duty;
}

static int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    return ((int64_t)duty * 1000000000LL + (int64_t)self->freq * MAX_16_DUTY / 2) / ((int64_t)self->freq * MAX_16_DUTY);
}

// Reconfigure PWM pin output as input/output. This allows to read the pin level.
static void reconfigure_pin(machine_pwm_obj_t *self) {
    bool invert = self->output_invert;
    if (self->channel_duty && (self->channel_duty == MAX_timer_duty)) {
        invert = !invert;
    }
    gpio_set_direction(self->pin, GPIO_MODE_INPUT_OUTPUT);
    if (self->mode == LEDC_LOW_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_LS_SIG_OUT0_IDX + self->channel, invert, false);
    #if SOC_LEDC_SUPPORT_HS_MODE
    } else if (self->mode == LEDC_HIGH_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_HS_SIG_OUT0_IDX + self->channel, invert, false);
    #endif
    }
}

static void apply_duty(machine_pwm_obj_t *self) {
    pwm_is_active(self);

    int duty = 0;
    if (self->duty_x == DUTY_16) {
        duty = self->duty_ui;
    } else if (self->duty_x == DUTY_10) {
        duty = self->duty_ui << (UI_RES_16_BIT - UI_RES_10_BIT);
    } else if (self->duty_x == DUTY_NS) {
        duty = ns_to_duty(self, self->duty_ui);
    }
    self->channel_duty = duty >> (UI_RES_16_BIT - timers[self->mode][self->timer].duty_resolution);

    if ((chans[self->mode][self->channel].pin == -1) || (self->channel_duty == 0) || (self->channel_duty == MAX_timer_duty)) {
        // New PWM assignment
        ledc_channel_config_t cfg = {
            .channel = self->channel,
            .duty = self->channel_duty,
            .gpio_num = self->pin,
            .intr_type = LEDC_INTR_DISABLE,
            .speed_mode = self->mode,
            .timer_sel = self->timer,
            .flags.output_invert = self->output_invert,
        };
        if (self->channel_duty && (self->channel_duty == MAX_timer_duty)) {
            cfg.duty = 0;
            cfg.flags.output_invert = !self->output_invert;
        }
        check_esp_err(ledc_channel_config(&cfg));
        if (self->light_sleep_enable) {
            // Disable SLP_SEL to change GPIO status automantically in lightsleep.
            check_esp_err(gpio_sleep_sel_dis(self->pin));
            chans[self->mode][self->channel].light_sleep_enable = true;
        }
        check_esp_err(ledc_bind_channel_timer(self->mode, self->channel, self->timer));
        reconfigure_pin(self);
    } else {
        check_esp_err(ledc_set_duty(self->mode, self->channel, self->channel_duty));
        check_esp_err(ledc_update_duty(self->mode, self->channel));
    }
    register_channel(self->mode, self->channel, self->pin, self->timer);
}

static uint32_t find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int resolution = ledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    if (resolution > UI_RES_16_BIT) {
        // limit resolution to user interface
        resolution = UI_RES_16_BIT;
    }
    return resolution;
}

static uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    if (self->channel_duty == MAX_timer_duty) {
        return MAX_16_DUTY;
    } else {
        return ledc_get_duty(self->mode, self->channel) << (UI_RES_16_BIT - timers[self->mode][self->timer].duty_resolution);
    }
}

static uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    // Scale down from 16 bit to 10 bit resolution
    return get_duty_u16(self) >> (UI_RES_16_BIT - UI_RES_10_BIT);
}

static uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}

static void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_16_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), MAX_16_DUTY);
    }

    self->duty_x = DUTY_16;
    self->duty_ui = duty;
    apply_duty(self);
}

static void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_10_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), MAX_10_DUTY);
    }
    self->duty_x = DUTY_10;
    self->duty_ui = duty;
    apply_duty(self);
}

static void set_duty_ns(machine_pwm_obj_t *self, int ns) {
    if ((ns < 0) || (ns > duty_to_ns(self, MAX_16_DUTY))) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_ns must be from 0 to %d ns"), duty_to_ns(self, MAX_16_DUTY));
    }
    self->duty_x = DUTY_NS;
    self->duty_ui = ns;
    apply_duty(self);
}

static void set_duty(machine_pwm_obj_t *self) {
    if (self->duty_x == DUTY_16) {
        set_duty_u16(self, self->duty_ui);
    } else if (self->duty_x == DUTY_10) {
        set_duty_u10(self, self->duty_ui);
    } else if (self->duty_x == DUTY_NS) {
        set_duty_ns(self, self->duty_ui);
    }
}

#if !(CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2)
// This check if a clock is already set in the timer list, if yes, return the LEDC_XXX value
static ledc_clk_cfg_t find_clock_in_use() {
    for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
        for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
            if (timers[mode][timer].clk_cfg != LEDC_AUTO_CLK) {
                return timers[mode][timer].clk_cfg;
            }
        }
    }
    return LEDC_AUTO_CLK;
}
#endif

static void check_freq_ranges(machine_pwm_obj_t *self, int freq, int upper_freq) {
    if ((freq <= 0) || (freq > upper_freq)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("frequency must be from 1Hz to %dMHz"), upper_freq / 1000000);
    }
}

// Set timer frequency
static void set_freq(machine_pwm_obj_t *self, unsigned int freq) {
    self->freq = freq;
    if (timers[self->mode][self->timer].freq != freq) {
        timers[self->mode][self->timer].freq = freq;

        ledc_timer_config_t timer = {};
        timer.speed_mode = self->mode;
        timer.timer_num = self->timer;
        timer.freq_hz = freq;
        timer.deconfigure = false;

        timer.clk_cfg = LEDC_AUTO_CLK;

        if (self->light_sleep_enable) {
            timer.clk_cfg = LEDC_USE_RC_FAST_CLK; // 8 or 20 MHz
        } else {
            #if SOC_LEDC_SUPPORT_APB_CLOCK
            timer.clk_cfg = LEDC_USE_APB_CLK; // 80 MHz
            #elif SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
            timer.clk_cfg = LEDC_USE_PLL_DIV_CLK; // 60 or 80 or 96 MHz
            #elif SOC_LEDC_SUPPORT_XTAL_CLOCK
            timer.clk_cfg = LEDC_USE_XTAL_CLK; // 40 MHz
            #else
            #error No supported PWM / LEDC clocks.
            #endif

            #ifdef EMPIRIC_FREQ // ESP32 and ESP32S2 only
            if (freq < EMPIRIC_FREQ) {
                timer.clk_cfg = LEDC_USE_REF_TICK; // 1 MHz
            }
            #endif
        }
        #if !(CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2)
        // Check for clock source conflic
        ledc_clk_cfg_t pwm_clk = find_clock_in_use();
        if ((pwm_clk != LEDC_AUTO_CLK) && (pwm_clk != timer.clk_cfg)) {
            mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("one or more active timers use a different clock source, not supported by the current SoC."));
        }
        #endif

